Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_post_primary_school/post_primary_education_for_students_with_special_needs.html.txt.tmx
Source language: en
Languages: ga

source: Special needs education: post-primary
ga: Oideachas riachtanas speisialta: oideachas iarbhunscoile

source: Students with special educational needs may be in ordinary classes in mainstream post-primary schools or in special classes in these schools or in special schools
ga: Féadfaidh mic léinn a bhfuil riachtanais speisialta oideachais acu a bheith i ngnáthranganna in iarbhunscoileanna príomhshrutha nó i ranganna speisialta i scoileanna den sórt sin nó i scoileanna speisialta

source: They may get help from learning support/resource teachers and care support from special needs assistants (SNAs)
ga: Féadfaidh siad cabhair a fháil ó mhúinteoirí acmhainne agus ó chúntóirí riachtanas speisialta (CRS)

source: Post-primary students with special educational needs may attend a mainstream post-primary school
ga: Féadfaidh mic léinn iar-bhunscoile a bhfuil riachtanais speisialta oideachais acu freastal ar iar-bhunscoil phríomhshrutha

source: They may be in mainstream classes with the support of a learning support/resource teacher and/or the care support of a special needs assistant or may be in a special class
ga: Féadfaidh siad a bheith i ngnáthranganna le tacú ó mhúinteoir tacaíochta/acmhainne agus/nó ó chúntóir riachtanas speisialta nó féadfaidh siad a bheith i rang speisialta

source: A school may apply for a grant to make the school accessible for a student with a disability, for example, to put in a ramp or accessible toilet accommodation
ga: Féadfaidh scoil iarratas a dhéanamh ar dheontas chun an scoil a fhágáil inrochtana ag mac léinn atá faoi mhíchumas, mar shampla, rampa nó leithreas inrochtana a chur isteach

source: Information about this provision can be obtained from the Building Unit of the Department of Education and Skills – see 'How to apply' below
ga: Is féidir faisnéis a fháil faoin bhforáil seo ó Aonad Foirgníochta na Roinne Oideachais agus Scileanna – féach “Conas iarratas a dhéanamh”

source: The following support services are available for students with disabilities and special educational needs attending post-primary schools:
ga: Tá na seirbhísí tacaíochta seo a leanas ar fáil do mhic léinn atá faoi mhíchumas agus a bhfuil riachtanais speisialta oideachais acu agus atá ag freastal ar iar-bhunscoileanna:

source: • Special needs assistants scheme (pdf)
ga: • Cúntóirí riachtanas speisialta (pdf)

source: If a student had additional teaching support in primary school, a formal assessment or diagnosis is required by the post-primary school when it applies for additional resource teaching for the student. You can download Children with Special Educational Needs (pdf) from the website of the National Council for Special Education
ga: Déanann an Chomhairle Náisiúnta um Oideachas Speisialta (CNOS) múinteoirí acmhainne a leithroinnt agus d’eisigh an Chomhairle sin Faisnéis agus Treoirlínte do Scoileanna Dara Leibhéil le linn Iarratais ar Acmhainní do Dhaltaí a bhfuil Riachtanais Speisialta Oideachais acu a phróiseáil (pdf)

source: Second-level pupils with dyslexia are normally integrated into ordinary classes
ga: De ghnáth freastalaíonn daltaí dara leibhéal a bhfuil disléicse orthu ar ghnáthranganna

source: In such situations, they may receive additional tutorial support from the learning support teacher, guidance counsellor and subject teachers
ga: I gcásanna den sórt sin, féadfaidh siad tacaíocht bhreise teagaisc a fháil ón múinteoir tacaíochta foghlama, ón treoirchomhairleoir agus ó mhúinteoirí na n-ábhar

source: There are special classes for students with special educational needs attached to a number of post-primary schools
ga: Tá ranganna speisialta do mhic léinn a bhfuil riachtanais speisialta oideachais acu ag gabháil le roinnt iar-bhunscoileanna

source: These classes usually cater for the learning needs of students with a mild or moderate level of learning disability
ga: Déanann na ranganna sin freastal de ghnáth do riachtanais fhoghlama mac léinn atá faoi mhíchumas foghlama éadrom nó measartha

source: There are special schools throughout the country for students with general learning disabilities
ga: Tá scoileanna speisialta ar fud na tíre do mhic léinn atá faoi mhíchumas foghlama ginearálta

source: These schools provide education for students from 5 to 18 years who have a general learning disability at a mild or moderate level
ga: Soláthraíonn na scoileanna sin oideachas do mhic léinn ó 5 bliana d’aois go 18 mbliana d’aois atá faoi mhíchumas foghlama ginearálta ag leibhéal éadrom nó measartha

source: In addition, there are post-primary schools for visually impaired and hearing impaired students in Dublin
ga: Ina theannta sin, tá iar-bhunscoileanna ann do mhic léinn lagamhairc nó lagéisteachta i mBaile Átha Cliath

source: These schools cater for both day students and boarders
ga: Freastalaíonn na scoileanna sin do mhic léinn lae agus do mhic léinn chónaithe

source: There are a small number of schools for students with physical disabilities and a small number of special schools for students who have behavioural and emotional difficulties
ga: Tá líon beag scoileanna ann do mhic léinn atá faoi mhíchumas fisiciúil agus líon beag scoileanna speisialta do mhic léinn atá deachrachtaí iompraíochta agus mhothúcháin

source: Students usually take the Junior Certificate and Leaving Certificate examinations
ga: De ghnáth, bíonn na mic léinn ag gabháil do scrúduithe an Teastais Shóisearaigh agus na hArdteistiméireachta

source: The schools also make provision for students whose level of disability would make it very difficult for them to benefit from the Junior and Leaving Certificate programmes
ga: Déanann na scoileanna socrú freisin do mhic léinn a bhfágfadh an míchumas atá orthu an deacair dóibh tairbhe a bhaint as cláir an Teastais Shóisearaigh nó na hArdteistiméireachta

source: In some schools for students with mild learning disabilities, students may be offered the opportunity to take part of the Junior Certificate curriculum
ga: I roinnt scoileanna do mhic léinn atá faoi mhíchumas foghlama éadrom, féadfar deis a thabhairt do mhic léinn páirt a ghlacadh i gcuraclam an Teastais Shóisearaigh

source: Students with specific disabilities may be exempt from part of the examination in a particular subject
ga: Féadfar mic léinn atá faoi mhíchumas sonrach a dhíolmhú ó chuid den scrúdú in ábhar áirithe

source: In such cases, the certificates awarded may note that the student has not sat an element of the examination
ga: I gcásanna den sórt sin, féadfar nóta a chur leis na teastais a dhámhtar nach ndearna an mac léinn cuid den scrúdú

source: The annotation is made where a core area of a subject is not assessed, or where the mode of assessment used has the same effect
ga: Déantar an nóta a chur leis i gcás nach measúnaítear réimse lárnach d’ábhar, nó i gcás ina bhfuil an éifeacht chéanna leis an modh measúnachta a úsáidtear

source: For example, hearing impaired students may be exempt from the aural component of the examination
ga: Mar shampla, féadfar mic léinn lagéisteachta a dhíolmhú ón triail chluastuisceana de chuid an scrúdaithe

source: The certificate would note that all elements of the subject were examined except the aural element
ga: Bheadh nóta ag gabháil leis an teastas go ndearnadh scrúdú ar gach gné den ábhar ach amháin an ghné cluastuisceana

source: Similarly, students with dyslexia may have spelling and grammar waivers in language subjects and their certificates would note this
ga: Ar an modh céanna, féadfaidh mic léinn a bhfuil disléicse orthu tarscaoiltí litrithe agus gramadaí a fháil sna teangacha agus bheadh nóta á rá sin ar an teastas

source: The Equality Tribunal ruled in 2006 that this annotation was contrary to the Equality Acts
ga: Chinn an Binse Comhionannais go bhfuil an nóta sin contrártha do na hAchtanna Comhionannais

source: This decision has since been appealed to the Supreme Court
ga: Rinneadh achomharc i gcoinne an chinnidh sin

source: There are arrangements in place for reasonable accommodation for students with disabilities sitting examinations
ga: Tá socruithe ar fáil chun oiriúntas réasúnach a sholáthar do mhic léinn atá faoi mhíchumas agus a dhéanann scrúduithe

source: Further education and training
ga: Conas iarratas a dhéanamh

source: If your child has special educational needs you should talk to the school principal about what learning supports are available in the school
ga: Má tá riachtanais speisialta oideachais ag do leanbh, ba cheart caint leis an príomhoide scoile faoi na tacaíochtaí fhoglama ar fáil sa scoil

source: If you need advice about a post-primary school which could meet your child's needs you should contact your local Special Educational Needs Organiser - see 'Where to apply' below
ga: Más mian leat comhairle faoin iar-bhunscoil oiriúnach le riachtanais speisialta do linbh déan teagmháil le do Eagraitheoir Riachtanas Speisialta Oideachais - féach 'Cá háit a ndéanfaidh mé iarratas'

source: Schools should contact the Building Unit of the Department of Education and Skills for information about making schools accessible
ga: Ba chóir do scoileanna teagmháil a dhéanamh le hAonad Foirgníochta na Roinne Oideachais agus Scileanna chun faisnéis a fháil maidir le scoileanna a fhágáil inrochtana

source: Call the main Department telephone number for assistance - see 'Where to apply'
ga: Cuir glaoch ar phríomhuimhir theileafóin na Roinne chun cúnamh a fháil – féach 'Cá háit a dhéanfaidh mé iarratas'

source: Schools should contact the National Council for Special Education (NSCE) which administers and processes applications for special educational resources using its network of Special Educational Needs Organisers (SENOs) - see 'Where to apply'. Where to apply Contact your local Special Educational Needs Organiser (SENO)
ga: Ba chóir do scoileanna teagmháil a dhéanamh leis an gComhairle Náisiúnta um Oideachas Speisialta (CNOS) a dhéanann iarratais ar acmhainní oideachais speisialta a riaradh agus a phróiseáil trí úsáid a bhaint as an líonra Eagraithe Riachtanas Speisialta Oideachais (ERSO) - féach 'Cá háit a dhéanfaidh mé iarratas'
